export class Dumy {
    constructor(){
        this.data = 
        [{
    
            "category": "한식",
    
            "shop_name": "다모아한식",
    
            "delivery_price": 4000,
    
            "shop_intro": " ",

            "menu_":[{"돼지불백":7000},{"오삼불고기":7500},{"뚝배기불고기":8000},{"갈비탕":12000},{"된장국":7000},{"김치찌개":7000}]
    
        }, 
        {
            "category": "한식",
    
            "shop_name": "행복한밥집",
    
            "delivery_price": 3000,
    
            "shop_intro": " ",
    
            "menu_":[{"돼지불백":7000},{"오삼불고기":7500},{"뚝배기불고기":8000},{"갈비탕":12000},{"된장국":7000},{"김치찌개":7000}]
        }, {
            "category": "한식",
    
            "shop_name": "미화식당",
    
            "delivery_price": 2000,
    
            "shop_intro": " ",
    
            "menu_":[{"돼지불백":7000},{"오삼불고기":7500},{"뚝배기불고기":8000},{"갈비탕":12000},{"된장국":7000},{"김치찌개":7000}]
        }, {
            "category": "한식",
    
            "shop_name": "농부가",
    
            "delivery_price": 4500,
    
            "shop_intro": " ",
    
            "menu_":[{"돼지불백":7000},{"오삼불고기":7500},{"뚝배기불고기":8000},{"갈비탕":12000},{"된장국":7000},{"김치찌개":7000}]
        },{
            "category": "한식",
    
            "shop_name": "새마을식당",
    
            "delivery_price": 3000,
    
            "shop_intro": " ",
    
            "menu_":[{"돼지불백":7000},{"오삼불고기":7500},{"뚝배기불고기":8000},{"갈비탕":12000},{"된장국":7000},{"김치찌개":7000}]
        },

        // ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


        {
            "category": "분식",
    
            "shop_name": "삼첩분식",
    
            "delivery_price": 3000,
    
            "shop_intro": " ",
    
            "menu_":[{"떡볶이":8900},{"로제떡볶이":9900},{"바질크림떡볶이":9900},{"마라로제떡볶이":9900},{"주먹밥":3500},{"순대":3500},{"펩시":2000},{"코카콜라":2000}]
        },{
            "category": "분식",
    
            "shop_name": "신전떡볶이",
    
            "delivery_price": 3000,
    
            "shop_intro": " ",
    
            "menu_":[{"떡볶이":8900},{"로제떡볶이":9900},{"바질크림떡볶이":9900},{"마라로제떡볶이":9900},{"주먹밥":3500},{"순대":3500},{"펩시":2000},{"코카콜라":2000}]
        },{
            "category": "분식",
    
            "shop_name": "33떡볶이",
    
            "delivery_price": 3500,
    
            "shop_intro": " ",
    
            "menu_":[{"떡볶이":8900},{"로제떡볶이":9900},{"바질크림떡볶이":9900},{"마라로제떡볶이":9900},{"주먹밥":3500},{"순대":3500},{"펩시":2000},{"코카콜라":2000}]
        },{
            "category": "분식",
    
            "shop_name": "죠스떡볶이",
    
            "delivery_price": 2000,
    
            "shop_intro": " ",
    
            "menu_":[{"떡볶이":8900},{"로제떡볶이":9900},{"바질크림떡볶이":9900},{"마라로제떡볶이":9900},{"주먹밥":3500},{"순대":3500},{"펩시":2000},{"코카콜라":2000}]
        }
        ,{
            "category": "분식",
    
            "shop_name": "명랑핫도그",
    
            "delivery_price": 3000,
    
            "shop_intro": " ",
    
            "menu_":[{"명량핫도그":1800},{"점보핫도그":2600},{"감자핫도그":3100},{"고구마통모짜 핫도그":3300},{"떡볶이":8900},{"로제떡볶이":9900},{"바질크림떡볶이":9900},{"마라로제떡볶이":9900},{"펩시":2000},{"코카콜라":2000}]
        },{
            "category": "분식",
    
            "shop_name": "청년다방",
    
            "delivery_price": 2000,
    
            "shop_intro": " ",
    
            "menu_":[{"차돌떡볶이":16500},{"통큰오짱떡볶이":16500},{"차새대떡볶이":23500},{"깻잎순대떡볶이":15500},{"치즈폭포순살떡볶이":18000},{"날치알볶음밥":2500},{"버터갈릭감자튀김":5500},{"콜라":1500},{"사이다":1500}]
        },

        // ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

        ,{
            "category": "치킨",
    
            "shop_name": "BBQ",
    
            "delivery_price": 4500,
    
            "shop_intro": " ",
    
            "menu_":[{"황금올리브치킨":20000},{"황금올리브치킨 닭다리":21000},{"황금올리브치킨 순살":22000},{"핫황금올리브치킨":20000},{"핫황금올리브치킨 닭다리":21000},{"핫황금올리브치킨 순살":22000},{"자메이카 소떡만나치킨":24000},{"자메이카 소떡만나치킨 순살":26000},{"콜라":1500},{"사이다":1500}]
        } ,{
            "category": "치킨",
    
            "shop_name": "노랑통닭",
    
            "delivery_price": 3000,
    
            "shop_intro": " ",
    
            "menu_":[{"엄청 큰 후라이드 치킨":18000},{"엄청 큰 반반 치킨":20000},{"알싸한 마늘 치킨":20000},{"뿌리노랑 치킨":20000},{"엄청 큰 깐풍 치킨":20000},{"콜라":1500},{"사이다":1500}]
        },{
            "category": "치킨",
    
            "shop_name": "굽네치킨",
    
            "delivery_price": 3500,
    
            "shop_intro": " ",
    
            "menu_":[{"고추바사삭":18000},{"남해마늘바사삭":20000},{"볼케이노":20000},{"오븐바사삭":18000},{"갈비천왕":20000},{"콜라":1500},{"사이다":1500}]
        },

     // ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

     {
        "category": "피자",
        
        "shop_name": "도미노피자",

        "delivery_price": 3000,

        "shop_intro": "도미노피자는 30년 이상의 역사를 가진 대한민국에서 가장 유명한 피자 브랜드 중 하나입니다.",

        "menu_":[{"페퍼로니피자":16000},{"불고기피자":20000},{"치즈피자":15000},{"콤비네이션피자":22000},{"포테이토피자":20000},{"콜라":1500},{"사이다":1500}]
     },{
        "category": "피자",

        "shop_name": "미스터피자",

        "delivery_price": 2500,

        "shop_intro": "미스터피자는 1990년에 처음 문을 열어 이제는 대한민국에서 가장 인기 있는 피자 체인점 중 하나입니다.",

        "menu_":[{"쉬림프골드피자":25000},{"딥치즈쉬림프피자":22000},{"불고기피자":20000},{"베이컨체다치즈피자":18000},{"포테이토피자":20000},{"콜라":1500},{"사이다":1500}]
     },
     {
        "category": "피자",

        "shop_name": "피자에땅",

        "delivery_price": 3500,

        "shop_intro": "피자에땅은 깔끔하고 신선한 재료로 만든 피자가 유명합니다.",

        "menu_":[{"콤비네이션피자":22000},{"페퍼로니피자":18000},{"고르곤졸라피자":25000},{"까르보네피자":22000},{"미트라이크피자":20000},{"콜라":1500},{"사이다":1500}]
    },
    {
        "category": "피자",

        "shop_name": "피자헛",

        "delivery_price": 3500,

        "shop_intro": "",

        "menu_":[{"쉬림프골드피자":25000},{"딥치즈쉬림프피자":22000},{"불고기피자":20000},{"베이컨체다치즈피자":18000},{"포테이토피자":20000},{"콜라":1500},{"사이다":1500}]
    }
     
     
    ]}
}